Dlubal.RFEM5.SurfaceGeometryType
Type of surface geometry

Dlubal.RFEM5.SurfaceGeometryType.UnknownGeometryType
Unknown type of surface geometry

Dlubal.RFEM5.SurfaceGeometryType.PlaneSurfaceType
Plane surface

Dlubal.RFEM5.SurfaceGeometryType.QuadrangleSurfaceType
Quadrangle surface

Dlubal.RFEM5.SurfaceGeometryType.BSplineSurfaceType
B-Spline surface

Dlubal.RFEM5.SurfaceGeometryType.RotatedSurfaceType
Rotated surface

Dlubal.RFEM5.SurfaceGeometryType.PipeSurfaceType
Pipe surface

Dlubal.RFEM5.SurfaceGeometryType.TrajectorySurfaceType
Trajectory surface

Dlubal.RFEM5.SurfaceGeometryType.NurbsSurfaceType
NURBS surface

Dlubal.RFEM5.SurfaceGeometryType.MinimumCurvatureSurfaceType
Surface of minimum curvature

Dlubal.RFEM5.SurfaceGeometryType.PartialSurfaceType
Partial surface

Dlubal.RFEM5.SurfaceGeometryType.ComponentSurfaceType
Component surface